app/controllers/dashboards_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def index
		user_id = session[:user_id]
		@name = User.find(user_id)